In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame.from_dict(dict([("A", [1, 2, 3]), ("B", [4, 5, 6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame.from_dict(
    dict([("A", [1, 2, 3]), ("B", [4, 5, 6])]), 
    orient="index", 
    columns=["one", "two", "three"], 
)

   one  two  three
A    1    2      3
B    4    5      6

In [6]:
d = {
    "one":pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]), 
    "two":pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])
}

In [7]:
df = pd.DataFrame(d)

In [8]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df["one"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [10]:
df["three"] = df["one"] * df["two"]

In [11]:
df["flag"] = df["one"] > 2

In [12]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [13]:
del df["two"]

In [14]:
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [15]:
three = df.pop("three")

In [16]:
three

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [17]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [18]:
df["foo"] = "bar"

In [19]:
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

In [20]:
df["one_trunc"] = df["one"][:2]

In [21]:
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

In [22]:
df.insert(1, "bar", df["one"])

In [23]:
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [25]:
from sklearn.datasets import load_iris

In [30]:
iris = pd.read_csv("C:\\ProgramData\\Anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv")

In [32]:
load_iris()

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv'}

In [40]:
iris = pd.DataFrame(data=load_iris().data, columns=load_iris().feature_names)

In [42]:
iris["name"] = load_iris().target

In [43]:
iris

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),name
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [45]:
iris.assign(sepal_ratio=iris['sepal width (cm)'] / iris["sepal length (cm)"]).head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),name,sepal_ratio
0,5.1,3.5,1.4,0.2,0,0.686275
1,4.9,3.0,1.4,0.2,0,0.612245
2,4.7,3.2,1.3,0.2,0,0.680851
3,4.6,3.1,1.5,0.2,0,0.673913
4,5.0,3.6,1.4,0.2,0,0.720000

In [46]:
iris.assign(sepal_ratio=lambda x:(x['sepal width (cm)']/x['sepal length (cm)'])).head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),name,sepal_ratio
0,5.1,3.5,1.4,0.2,0,0.686275
1,4.9,3.0,1.4,0.2,0,0.612245
2,4.7,3.2,1.3,0.2,0,0.680851
3,4.6,3.1,1.5,0.2,0,0.673913
4,5.0,3.6,1.4,0.2,0,0.720000

In [47]:
dfa = pd.DataFrame({"A":[1, 2, 3], "B":[4, 5, 6]})
dfa.assign(C=lambda x:x["A"]+x["B"], D=lambda x:x["A"]+x["C"])

   A  B  C   D
0  1  4  5   6
1  2  5  7   9
2  3  6  9  12

In [48]:
df.loc["b"]

one            2.0
bar            2.0
flag         False
foo            bar
one_trunc      2.0
Name: b, dtype: object

In [49]:
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [50]:
df.loc["b"]

one            2.0
bar            2.0
flag         False
foo            bar
one_trunc      2.0
Name: b, dtype: object

In [51]:
df.iloc[2]

one           3.0
bar           3.0
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

In [52]:
df = pd.DataFrame(np.random.randn(10, 4), columns=["A", "B", "C", "D"])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=["A", "B", "C"])

df + df2

          A         B         C   D
0  0.715182  0.603499  0.084277 NaN
1 -0.311552 -1.089148 -0.199672 NaN
2 -0.576827 -0.671541 -0.895998 NaN
3 -1.387339 -0.134288  2.484185 NaN
4 -0.460703  1.534853 -0.123024 NaN
5 -1.514945 -1.869982 -1.106410 NaN
6  1.352058 -1.930731  1.015925 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [53]:
df

          A         B         C         D
0 -0.347739  0.366616  1.218221  0.901168
1  0.610439 -2.114071  0.291648  0.599201
2 -1.232195 -1.506216 -0.075378 -1.907317
3  0.009063 -0.829466  1.182274  1.165767
4  0.800611  0.152894  1.083943 -0.045122
5 -1.252337  0.612977 -1.254989 -1.119352
6  1.009768 -1.496519  1.623105  0.058173
7 -0.230077  0.486110 -0.319491 -0.811143
8  1.312215  0.866004  0.759610  0.508451
9 -1.676770 -0.239704  2.010262  0.106457

In [54]:
df2

          A         B         C
0  1.062921  0.236883 -1.133944
1 -0.921991  1.024924 -0.491320
2  0.655367  0.834675 -0.820620
3 -1.396402  0.695179  1.301911
4 -1.261314  1.381959 -1.206967
5 -0.262608 -2.482959  0.148579
6  0.342290 -0.434212 -0.607179

In [55]:
df.loc[0]

A   -0.347739
B    0.366616
C    1.218221
D    0.901168
Name: 0, dtype: float64

In [56]:
df - df.loc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.958178 -2.480687 -0.926573 -0.301967
2 -0.884456 -1.872832 -1.293599 -2.808485
3  0.356802 -1.196082 -0.035947  0.264599
4  1.148349 -0.213722 -0.134278 -0.946290
5 -0.904598  0.246361 -2.473210 -2.020521
6  1.357507 -1.863135  0.404884 -0.842995
7  0.117661  0.119495 -1.537712 -1.712311
8  1.659954  0.499388 -0.458611 -0.392717
9 -1.329031 -0.606320  0.792041 -0.794711

In [57]:
df * 5 +2

          A         B          C         D
0  0.261306  3.833079   8.091106  6.505842
1  5.052195 -8.570357   3.458239  4.996006
2 -4.160973 -5.531080   1.623112 -7.536583
3  2.045317 -2.147331   7.911370  7.828836
4  6.003053  2.764470   7.419715  1.774391
5 -4.261683  5.064886  -4.274945 -3.596762
6  7.048839 -5.482594  10.115524  2.290866
7  0.849613  4.430552   0.402543 -2.055713
8  8.561074  6.330021   5.798051  4.542255
9 -6.383849  0.801481  12.051310  2.532287

In [60]:
1/df

            A         B          C          D
0   -2.875721  2.727651   0.820869   1.109670
1    1.638165 -0.473021   3.428792   1.668888
2   -0.811560 -0.663915 -13.266555  -0.524297
3  110.332955 -1.205595   0.845828   0.857804
4    1.249047  6.540478   0.922558 -22.162276
5   -0.798507  1.631382  -0.796820  -0.893374
6    0.990327 -0.668217   0.616103  17.190041
7   -4.346364  2.057146  -3.129975  -1.232829
8    0.762070  1.154729   1.316465   1.966758
9   -0.596385 -4.171816   0.497448   9.393425

In [61]:
df ** 4

              A          B          C          D
0  1.462221e-02   0.018065   2.202442   0.659514
1  1.388575e-01  19.974626   0.007235   0.128911
2  2.305246e+00   5.146940   0.000032  13.233999
3  6.748061e-09   0.473364   1.953766   1.846917
4  4.108519e-01   0.000546   1.380466   0.000004
5  2.459713e+00   0.141181   2.480617   1.569884
6  1.039648e+00   5.015667   6.940427   0.000011
7  2.802178e-03   0.055839   0.010419   0.432901
8  2.964967e+00   0.562445   0.332938   0.066834
9  7.904853e+00   0.003301  16.330918   0.000128

In [62]:
df1 = pd.DataFrame({"a":[1, 0, 1], "b":[0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({"a":[0, 1, 1], "b":[1, 1, 0]}, dtype=bool)

In [63]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [64]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [65]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [66]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [67]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [68]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [70]:
df[:5].T

          0         1         2         3         4
A -0.347739  0.610439 -1.232195  0.009063  0.800611
B  0.366616 -2.114071 -1.506216 -0.829466  0.152894
C  1.218221  0.291648 -0.075378  1.182274  1.083943
D  0.901168  0.599201 -1.907317  1.165767 -0.045122

In [71]:
np.exp(df)

          A         B         C         D
0  0.706283  1.442843  3.381168  2.462479
1  1.841240  0.120745  1.338632  1.820664
2  0.291652  0.221747  0.927393  0.148478
3  1.009105  0.436282  3.261783  3.208383
4  2.226900  1.165201  2.956313  0.955881
5  0.285836  1.845919  0.285079  0.326491
6  2.744964  0.223908  5.068803  1.059899
7  0.794472  1.625980  0.726519  0.444350
8  3.714392  2.377392  2.137443  1.662714
9  0.186977  0.786861  7.465273  1.112331

In [72]:
np.asarray(df)

array([[-0.34773886,  0.36661581,  1.21822117,  0.90116845],
       [ 0.61043908, -2.11407145,  0.29164787,  0.59920127],
       [-1.23219462, -1.5062161 , -0.07537752, -1.90731655],
       [ 0.00906348, -0.82946625,  1.18227393,  1.16576716],
       [ 0.80061057,  0.15289403,  1.08394298, -0.04512172],
       [-1.25233664,  0.61297714, -1.25498909, -1.1193525 ],
       [ 1.00976784, -1.49651881,  1.62310476,  0.05817322],
       [-0.23007737,  0.48611041, -0.31949133, -0.81114256],
       [ 1.31221488,  0.86600426,  0.75961026,  0.50845103],
       [-1.67676982, -0.23970377,  2.01026194,  0.10645745]])

In [73]:
ser1 = pd.Series([1, 2, 3], index=["a", "b", "c"])
ser2 = pd.Series([1, 3, 5], index=["b", "a", "c"])

In [74]:
ser1

a    1
b    2
c    3
dtype: int64

In [75]:
ser2

b    1
a    3
c    5
dtype: int64

In [77]:
np.remainder(ser1, ser2)

a    1
b    0
c    3
dtype: int64

In [78]:
ser3 = pd.Series([2, 4, 6], index=["b", "c", "d"])
ser3

b    2
c    4
d    6
dtype: int64

In [79]:
np.remainder(ser1, ser3)

a    NaN
b    0.0
c    3.0
d    NaN
dtype: float64

In [80]:
from pl

ModuleNotFoundError: No module named 'plyr'